Imports System.Data.SqlClient

Module Module_license
    Friend str_cmpn As String
    Friend str_taxid As String
    Friend Function company_licensse() As Boolean
        'Dim str_cmpn As String = "" 'เปลี่ยนไปประกาศ friend เพื่อให้ใช้ได้ทั้ง project
        'Dim str_taxid As String = ""

        '==================================================='
        'บีแอล เปเปอร์
        'str_cmpn = "ห้างหุ้นส่วนจำกัด บีแอล เปเปอร์ เซอร์วิส" : str_taxid = "0143561000494"
        '==================================================='
        'ห้างหุ้นส่วนจำกัดสิริวัชระ
        'str_cmpn = "หจก.สิริวัชระ" : str_taxid = "0623527000172"
        '==================================================='
        'บริษัท นครจิรชัย คอนสตรัคชั่น จำกัด (สำนักงานใหญ่)
        'str_cmpn = "บริษัท นครจิรชัย คอนสตรัคชั่น จำกัด (สำนักงานใหญ่)" : str_taxid = "0655563001428"
        '==================================================='
        'วี.ที.เอ็นจิเนียริ่ง(2018)
        'str_cmpn = "ห้างหุ้นส่วนจำกัดวี.ที.เอ็นจิเนียริ่ง(2018)" : str_taxid = "0103561013286"
        '==================================================='
        'เอส เจ รีเวท
        'str_cmpn = "เอส เจ รีเวท" : str_taxid = "3430500465500"
        '==================================================='
        'ห้างหุ้นส่วนจำกัด ว่องเจริญคอนกรีต
        'str_cmpn = "ห้างหุ้นส่วนจำกัด ว่องเจริญคอนกรีต" : str_taxid = "0383562000054"
        '==================================================='
        'ห้างหุ้นส่วนจำกัด พีซีเอหนองปลาไหล พัทยา
        'str_cmpn = "ห้างหุ้นส่วนจำกัด พีซีเอหนองปลาไหล พัทยา" : str_taxid = "0203558000135"
        '==================================================='
        'ห้างหุ้นส่วนจำกัด วีไอพี การ์เมนท์แอนด์เทรดดิ้ง
        'str_cmpn = "ห้างหุ้นส่วนจำกัด วีไอพี การ์เมนท์แอนด์เทรดดิ้ง" : str_taxid = "0103563005370"
        '==================================================='
        'ร้านเก่งเจริญทรัพย์เฟอร์นิเจอร์
        'str_cmpn = "ร้านเก่งเจริญทรัพย์เฟอร์นิเจอร์" : str_taxid = "1302000153921"
        '==================================================='
        'หจก.พีเค เมดิคอล ซัพพลาย
        'str_cmpn = "หจก.พีเค เมดิคอล ซัพพลาย" : str_taxid = "0503563004876"
        '==================================================='

        'ห้างหุ้นส่วนจำกัด ออสตัน
        'str_cmpn = "ห้างหุ้นส่วนจำกัด ออสตัน" : str_taxid = "0723562000379"
        '==================================================='

        'บริษัท เมืองชลเบเกอรี่ แอนด์ ซัพพลาย
        'str_cmpn = "บริษัท เมืองชลเบเกอรี่ แอนด์ ซัพพลาย จำกัด" : str_taxid = "0205563032688"
        '==================================================='


        'ห้างหุ้นส่วนจำกัด เคเอ็น ดีไซน์ แอนด์ เดคคอเรท
        'str_cmpn = "ห้างหุ้นส่วนจำกัด เคเอ็น ดีไซน์ แอนด์ เดคคอเรท" : str_taxid = "0103564006281"
        '==================================================='
        'บริษัท เวลเนส ไอดอล จำกัด
        'str_cmpn = "บริษัท เวลเนส ไอดอล จำกัด" : str_taxid = "0125544008221"
        '==================================================='
        'บริษัท พี.เอส.ดี. เอกซ์พอร์ตติ้ง จำกัด
        'str_cmpn = "บริษัท พี.เอส.ดี. เอกซ์พอร์ตติ้ง จำกัด" : str_taxid = "0775562001521"
        '==================================================='
        'บริษัท เอ็มเอ็นวาย เทคนิคแอนด์ซัพพลาย จำกัด
        'str_cmpn = "บริษัท เอ็มเอ็นวาย เทคนิคแอนด์ซัพพลาย จำกัด" : str_taxid = "0205559001986"
        '==================================================='
        'T.R. FRESH PORK
        'str_cmpn = "T.R. FRESH PORK" : str_taxid = "" 'ยังไม่จดทะเบียน tr มีเคาะวรรคด้วย
        '==================================================='
        'บริษัท เอสเอสดับเบิลยู ฟู๊ด จำกัด ชื่อบริษัท ลูกค้า ไม่เคาะวรรค
        'str_cmpn = "บริษัท เอสเอสดับเบิลยู ฟู๊ด จำกัด" : str_taxid = "0505561003564"
        '==================================================='
        'บจก.ทรัพย์บูรณนันท์ออยล์
        'str_cmpn = "บริษัท ทรัพย์บูรณนันท์ออยล์ จำกัด" : str_taxid = "0735558000221"
        '==================================================='
        'บริษัท แสงอรุณ เดคคอร์ จำกัด
        'str_cmpn = "บริษัท แสงอรุณ เดคคอร์ จำกัด" : str_taxid = "0125559010781"
        ''==================================================='
        'ห้างหุ้นส่วนจำกัด อี้เซิง
        'str_cmpn = "ห้างหุ้นส่วนจำกัด อี้เซิง" : str_taxid = "0133546002007"
        '==================================================='
        'ป ประยุทธการช่าง
        'str_cmpn = "ป.ประยุทธการช่าง" : str_taxid = "3100100358296"
        '==================================================='
        'แสงเสียงอิเลคโทนิค
        'str_cmpn = "แสงเสียงอิเลคโทนิค" : str_taxid = "3339900114720"
        '==================================================='
        'บริษัท อนุภาษวิวิธการ จำกัด
        'str_cmpn = "บริษัท อนุภาษวิวิธการ จำกัด" : str_taxid = "0835532000843"
        '==================================================='

        'บริษัท อนุภาษ ออโต้ เวิร์คส์ จำกัด : เปลี่ยนจาก บริษัท อนุภาษวิวิธการ ซื้อ license ใหม่ ใช้ database เดิม
        'create 1-11-2023
        'str_cmpn = "บริษัท อนุภาษ ออโต้ เวิร์คส์ จำกัด" : str_taxid = "0835566039114"
        '==================================================='

        'พูลทรัพย์
        'str_cmpn = "พูลทรัพย์" : str_taxid = "3140100009658"
        '==================================================='

        'บริษัท บุญเลี้ยงฟาร์ม จำกัด 
        'str_cmpn = "บริษัท บุญเลี้ยงฟาร์ม จำกัด" : str_taxid = "0675559001249"
        '==================================================='

        'ห้างหุ้นส่วนจำกัด นราทิพย์เรสเตอรองท์
        'str_cmpn = "ห้างหุ้นส่วนจำกัด นราทิพย์เรสเตอรองท์" : str_taxid = "0103554064717"
        '==================================================='

        'ห้างหุ้นส่วนจำกัด ดีดี การ์เด้น โฮม
        'str_cmpn = "ห้างหุ้นส่วนจำกัด ดีดี การ์เด้น โฮม" : str_taxid = "0563560001744"
        '==================================================='

        'ห้างหุ้นส่วนจำกัด สยามคิงส์ คอนกรีต
        'str_cmpn = "ห้างหุ้นส่วนจำกัด สยามคิงส์ คอนกรีต" : str_taxid = "0143564001581"
        '==================================================='

        'บริษัท สรรพกิจ เอส.เค.(1991) จำกัด
        'str_cmpn = "บริษัท สรรพกิจ เอส.เค.(1991) จำกัด" : str_taxid = "0635534000052"
        '==================================================='

        'บริษัท โชคดี เคมิคอล จำกัด
        'str_cmpn = "บริษัท โชคดี เคมิคอล จำกัด" : str_taxid = "0105552030868"
        '==================================================='

        'บริษัท สยาม เจนเนอรัล อีควิปเม้นท์ จำกัด
        'str_cmpn = "บริษัท สยาม เจนเนอรัล อีควิปเม้นท์ จำกัด" : str_taxid = "0125558022379"
        '==================================================='

        ''ห้างหุ้นส่วนจำกัด พฤษธิไกร คูลลิ่ง เซ็นเตอร์
        'str_cmpn = "ห้างหุ้นส่วนจำกัด พฤษธิไกร คูลลิ่ง เซ็นเตอร์" : str_taxid = "0733548000553"
        ''==================================================='


        'ห้างหุ้นส่วนจำกัด เพิ่มพูล โทนเนอร์ (2010) (ยกเลิก คืนเงินลูกค้า)
        'create 13-8-2023
        'str_cmpn = "ห้างหุ้นส่วนจำกัด เพิ่มพูล โทนเนอร์ (2010)" : str_taxid = "0643553000788"
        '==================================================='

        'บริษัท เจ เอส พี โพรเกรส จำกัด
        'create 10-9-2023
        'str_cmpn = "บริษัท เจ เอส พี โพรเกรส จำกัด" : str_taxid = "0105566025161"
        '==================================================='

        'ห้างหุ้นส่วนจำกัด ซุปเปอร์ไข่ เชียงใหม่
        'create 1-11-2023
        'str_cmpn = "ห้างหุ้นส่วนจำกัด ซุปเปอร์ไข่ เชียงใหม่" : str_taxid = "0503566000626"
        '==================================================='

        'บริษัท เอ็ม.ซี.สายไฮดรอลิค จำกัด
        'create 6-11-2023
        'str_cmpn = "บริษัท เอ็ม.ซี.สายไฮดรอลิค จำกัด" : str_taxid = "0205547020816"
        '==================================================='

        'ห้างหุ้นส่วนจำกัด อาบสุวรรณ เวิลด์ออฟเมทัล
        'create 6-11-2023
        'str_cmpn = "ห้างหุ้นส่วนจำกัด อาบสุวรรณ เวิลด์ออฟเมทัล" : str_taxid = "0113543004149"
        '==================================================='

        'เจ้ติ๋วผักสดนครนายก
        'create 12-2-2024
        'str_cmpn = "เจ้ติ๋วผักสดนครนายก" : str_taxid = "2309900002397"
        '==================================================='

        'บริษัท อนุภาษ เน็กซ์ จำกัด
        'create 16-3-2024
        'str_cmpn = "บริษัท อนุภาษ เน็กซ์ จำกัด" : str_taxid = "0835566039459"
        '==================================================='

        'บริษัท ไป๋ว่านฟู่เวิง289 จำกัด
        'create 20-4-2024
        'str_cmpn = "บริษัท ไป๋ว่านฟู่เวิง289 จำกัด" : str_taxid = "0115565017261"
        '==================================================='

        'บริษัท พรพิทักษ์ วายมอเตอร์ จำกัด
        'create 16-5-2024
        'str_cmpn = "บริษัท พรพิทักษ์ วายมอเตอร์ จำกัด" : str_taxid = "0385567000011"
        '==================================================='

        'ห้างหุ้นส่วนจำกัด ว่องเจริญปิโตรเลียม
        'create 2025-4-7
        'str_cmpn = "ห้างหุ้นส่วนจำกัด ว่องเจริญปิโตรเลียม" : str_taxid = "0383560000022"

        'นำชัยท่าแซะการเกษตร
        'create 29-5-2025
        'str_cmpn = "นำชัยท่าแซะการเกษตร" : str_taxid = "1869900259930"
        '==================================================='

        'บริษัท ธนิยะอินฟราเทค จำกัด
        'create 7-9-2025
        str_cmpn = "บริษัท ธนิยะอินฟราเทค จำกัด" : str_taxid = "0105549058757"
        '==================================================='


        Dim RESULT As Boolean
        Dim DS As New DataSet 'ประเภทลูกหนี้
        DS.Clear()
        Dim sql6 As String = "SELECT *"
        sql6 &= " FROM COMPANY"
        Try 'ตรวจสอบ connection
            Dim cmd_dept As New SqlCommand(sql6, cnn_sql_main)
            Dim adapter_dept As New SqlDataAdapter(cmd_dept)
            adapter_dept.Fill(DS, "COMPANY_LICENSE")
            If DS.Tables("COMPANY_LICENSE").Rows.Count > 0 Then
                'ใช้ like ชื่อบริษัท ตามด้วย * เพื่อให้สามารถ ใส่ สำนักงานใหญ่ หลังชื่อได้
                If DS.Tables("COMPANY_LICENSE").Rows(0).Item("CMPN_NAME") Like str_cmpn & "*" _
                    And DS.Tables("COMPANY_LICENSE").Rows(0).Item("CMPN_TAXID") = str_taxid Then
                    RESULT = True
                Else
                    RESULT = False
                End If
            Else
                RESULT = False
            End If
            Return RESULT
        Catch ex As Exception
            Return False
        End Try
    End Function
End Module
